# Pandas

In [3]:
import pandas as pd

In [5]:
bebidas = { 
    "r0": ["coca", 10, 5],
    "r1": ["guaraná", 12, 3],
    "r3": ["fanta", 7, 0],
    "r4": ["tubaína", 5, 0]
}

In [7]:
df = pd.DataFrame(bebidas)
df

     r0       r1     r3       r4
0  coca  guaraná  fanta  tubaína
1    10       12      7        5
2     5        3      0        0

In [23]:
df = df.T
df

     r0       r1     r3       r4
0  coca  guaraná  fanta  tubaína
1    10       12      7        5
2     5        3      0        0

In [19]:
bebidas_dic = {
    'botao': [],
    'nome': [],
    'qtd': [],
    'preco': [],
}
for k, v in bebidas.items():
    bebidas_dic['botao'].append(k)
    bebidas_dic['nome'].append(v[0])
    bebidas_dic['qtd'].append(v[1])
    bebidas_dic['preco'].append(v[2])

print(bebidas_dic)

df2 = pd.DataFrame(bebidas_dic)
df2

{'botao': ['r0', 'r1', 'r3', 'r4'], 'nome': ['coca', 'guaraná', 'fanta', 'tubaína'], 'qtd': [10, 12, 7, 5], 'preco': [5, 3, 0, 0]}

  botao     nome  qtd  preco
0    r0     coca   10      5
1    r1  guaraná   12      3
2    r3    fanta    7      0
3    r4  tubaína    5      0

In [25]:
df = df.T
df.reset_index()

  index        0   1  2
0    r0     coca  10  5
1    r1  guaraná  12  3
2    r3    fanta   7  0
3    r4  tubaína   5  0

In [26]:
df.rename(columns = {'index': 'botao', 0: 'nome', 1: 'Preço', 2: 'Quantidade' })

       nome Preço Quantidade
r0     coca    10          5
r1  guaraná    12          3
r3    fanta     7          0
r4  tubaína     5          0